"use client";
import React, { useEffect, useState } from "react";
import AOS from "aos";
import "aos/dist/aos.css";



const faqData = [
  {
    question: "1.  איזה מידע אנחנו אוספים?",
    answer:
      'אנו אוספים מידע אישי שאתה מוסר לנו מרצונך כאשר אתה נרשם לאתר, מביע עניין בקבלת מידע אודותינו או על המוצרים והשירותים שלנו, כאשר אתה משתתף בפעילויות באתר או בדרך אחרת כאשר אתה יוצר איתנו קשר. המידע האישי שאנו אוספים תלוי בהקשר של האינטראקציות שלך איתנו ועם האתר, הבחירות שאתה עושה והמוצרים והתכונות שבהם אתה משתמש. המידע האישי שאנו אוספים עשוי לכלול את הדברים הבאים: מידע אישי המסופק על ידך. אנו אוספים שמות; מספרי טלפון; כתובות דוא"ל; כתובות דואר; העדפות יצירת קשר; נתוני קשר או אימות; כתובות חיוב; מספרי כרטיסי חיוב/אשראי; סיסמאות; ומידע דומה אחר. נתוני תשלום. אנו עשויים לאסוף נתונים הדרושים לעיבוד התשלום שלך אם תבצע רכישות, כגון מספר אמצעי התשלום שלך (כגון מספר כרטיס אשראי), וקוד האבטחה המשויך לאמצעי התשלום שלך. כל נתוני התשלום מאוחסנים על ידי וורלדפאיי, פייפאל ו-אמזון פיי. תוכל למצוא קישורים להודעת הפרטיות שלהם כאן.',
  },
  {
    question: "2. כיצד אנו משתמשים במידע שלך?",
    answer:
      'בקיצור: אנו מעבדים את המידע שלך למטרות המבוססות על אינטרסים עסקיים לגיטימיים, קיום החוזה שלנו איתך, עמידה בהתחייבויות החוקיות שלנו ו/או הסכמתך. אנו משתמשים במידע אישי שנאסף דרך האתר שלנו למגוון מטרות עסקיות המתוארות להלן. אנו מעבדים את המידע האישי שלך למטרות אלו תוך הסתמכות על האינטרסים העסקיים הלגיטימיים שלנו, על מנת להתקשר או לבצע חוזה איתך, בהסכמתך ו/או לשם עמידה בהתחייבויות המשפטיות שלנו. אנו מציינים את עילות העיבוד הספציפיות עליהן אנו מסתמכים לצד כל מטרה המפורטת להלן.',
  },
  {
    question: "3.  האם המידע שלך ישותף עם מישהו?",
    answer:
      "בקצרה: אנו משתפים מידע רק בהסכמתך, כדי לציית לחוקים, כדי לספק לך שירותים, להגן על זכויותיך או למלא חובות עסקיות. הסכמה: אנו עשויים לעבד את הנתונים שלך אם נתת לנו הסכמה ספציפית לשימוש שלך מידע אישי למטרה מסוימת. אינטרסים לגיטימיים: אנו עשויים לעבד את הנתונים שלך כאשר הדבר נחוץ באופן סביר כדי להשיג את האינטרסים העסקיים הלגיטימיים שלנו. ביצוע חוזה: כאשר התקשרנו איתך בחוזה, אנו עשויים לעבד את המידע האישי שלך כדי למלא את תנאי החוזה שלנו. חובות משפטיות: אנו עשויים לחשוף את המידע שלך כאשר אנו נדרשים על פי חוק לעשות זאת כדי לציית לחוק החל, בקשות ממשלתיות, הליך שיפוטי, צו בית משפט או הליך משפטי, כגון בתגובה לצו בית משפט או הזמנה לדין ( כולל בתגובה לרשויות ציבוריות כדי לעמוד בדרישות הביטחון הלאומי או אכיפת החוק). אינטרסים חיוניים: אנו עשויים לחשוף את המידע שלך כאשר אנו מאמינים כי יש צורך לחקור, למנוע או לנקוט בפעולה בנוגע להפרות פוטנציאליות של המדיניות שלנו, חשד להונאה, מצבים הכרוכים באיומים פוטנציאליים על ביטחונו של כל אדם ופעילויות בלתי חוקיות, או כראיה ב ליטיגציה שבה אנו מעורבים.",
  },
  {
    question: "4.עם מי המידע שלך ישותף?",
    answer:
      "בקיצור: אנו חולקים מידע רק עם הקטגוריות הבאות של צדדים שלישיים. אנו משתפים וחושפים את המידע שלך רק עם הקטגוריות הבאות של צדדים שלישיים. אם עיבדנו את הנתונים שלך על סמך הסכמתך וברצונך לבטל את הסכמתך, אנא צור איתנו קשר באמצעות פרטי ההתקשרות המופיעים בסעיף למטה שכותרתו כיצד תוכל ליצור איתנו קשר לגבי מדיניות זו? מעבדי תשלומים ספקי שירותי אימות זהות ספקי שירותי מימוש הזמנות פיננסים וחשבונאות",
  },
  {
    question: "5.האם אנו משתמשים בעוגיות ובטכנולוגיות מעקב אחרות?",
    answer:
      "בקיצור: אנו עשויים להשתמש בעוגיות ובטכנולוגיות מעקב אחרות כדי לאסוף ולאחסן את המידע שלך. אנו עשויים להשתמש בעוגיות ובטכנולוגיות מעקב דומות (כמו משואות אינטרנט ופיקסלים) כדי לגשת למידע או לאחסן אותו. מידע ספציפי על האופן שבו אנו משתמשים בטכנולוגיות כאלה וכיצד אתה יכול לסרב לעוגיות מסוימות מפורט במדיניות העוגיות שלנו.",
  },
  {
    question: "6.אימות זהות",
    answer:
      "כדי להבטיח שלא נעשה שימוש בכרטיס האשראי, החיוב או החיוב שלך ללא הסכמתך ואתה מעל גיל 18, אנו נאמת את השם, הכתובת ומידע אישי אחר שסופק על ידך במהלך תהליך ההזמנה מול מאגרי מידע מתאימים של צד שלישי. על ידי קבלת תנאים והגבלות אלה, אתה מסכים לביצוע בדיקות כאלה. בביצוע בדיקות אלה, מידע אישי שסופק על ידך עשוי להיחשף לסוכנות רשומה להפניית אשראי אשר עשויה לשמור תיעוד של מידע זה. אתה יכול להיות סמוך ובטוח שזה נעשה רק כדי לאשר את זהותך, שלא מתבצעת בדיקת אשראי ושדירוג האשראי שלך לא יושפע. כל המידע שיסופק על ידך יטופל בצורה מאובטחת וקפדנית בהתאם לחוק הגנת הנתונים 1998.",
  },
  {
    question: "7.מדיניות החזרות/החזרים",
    answer:
      "אנא עיין במדיניות ההחזרה שלנו המפורסמת באתר לפני ביצוע רכישות כלשהן.",
  },
];
const Page = () => {
  const [activeIndex, setActiveIndex] = useState(null);

  const toggleAccordion = (index) => {
    setActiveIndex(activeIndex === index ? null : index);
  };

  useEffect(()=>{
    AOS.init({duration:1000});
  },[])
  return (
    <>
      <div className="lg:mt-28 mb-10 mx-5 md:mx-0" data-aos="fade-up">
        <div className="2xl:w-[1500px] xl:w-[1000px]  lg:w-[880px]  md:w-[600px] sm:w-[500px]   m-auto mt-20 2xl:mt-44 lg:mt-28 sm:mt-24  nav" >
          <h1 className="font-semibold text-[25px] sm:text-[35px] lg:text-2xl   mb-5 ">
          מדיניות הפרטיות
          </h1>
          <div className="text-[12px] lg:text-[16px] 2xl:text-[18px]">
            <p>
            עודכן לאחרונה ב-13 בינואר 2024
              <br />
              <br />
              ב-משקאות מיוחדים בע מ - כאן עושה עסקים כמו הוויסקי
              Exchange (בורסת הוויסקי אנחנו אנחנו או שלנו) - אנחנו מחויבים
              להגנה על המידע האישי שלך ועל זכותך לפרטיות.
              אם יש לך שאלות או חששות לגבי הודעת פרטיות זו או
              הנהלים שלנו בנוגע למידע האישי שלך, בבקשה
              פנה אלינו בכתובת הגנת מידע@בורסת הוויסקי.קום. <br />
              <br />
              הודעת פרטיות זו מתארת ​​כיצד אנו עשויים להשתמש במידע שלך אם
              אתה: <br />
              <br />
              - בקר באתר האינטרנט שלנו בכתובת https://www.thewhiskyexchange.com <br/>
              <br/> - לעסוק ב
              אותנו בדרכים קשורות אחרות - כולל כל מכירות, שיווק או
              אירועים<br/>
              <br/>בהודעת פרטיות זו, אם אנו מתייחסים ל: <br/>
              <br/>- אתר שאנחנו
              הפניה לכל אתר אינטרנט שלנו שמפנה או מקשר לזה
              מְדִינִיוּת<br/>
              <br/>- שירותים שאנו מפנים לאתר האינטרנט שלנו, ולשאר קשורים
              שירותים, לרבות כל מכירות, שיווק או אירועים<br/>
              <br/>המטרה של
              הודעת פרטיות זו נועדה להסביר לך בצורה הברורה ביותר
              אפשרי איזה מידע אנו אוספים, כיצד אנו משתמשים בו ובמה
              זכויות שיש לך ביחס אליו. אם יש תנאים בזה
              הודעת פרטיות שאינך מסכים איתה, אנא הפסק את השימוש
              של השירותים שלנו באופן מיידי.
            </p>
            {faqData.map((faq, index) => (
              <div key={index} className="mt-4 border-b border-gray-300">
                <button
                  className="flex justify-between items-center w-full text-left"
                  onClick={() => toggleAccordion(index)}
                >
                  <h2 className="text-[#6d6c6c] font-medium text-[12px] lg:text-[16px]  2xl:text-[18px] py-3">
                    {faq.question}
                  </h2>
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    className={`h-6 w-6 transition-transform transform ${
                      activeIndex === index ? "rotate-180" : "rotate-0"
                    }`}
                    fill="none"
                    viewBox="0 0 24 24"
                    stroke="currentColor"
                  >
                    <path
                      strokeLinecap="round"
                      strokeLinejoin="round"
                      strokeWidth={2}
                      d="M19 9l-7 7-7-7"
                    />
                  </svg>
                </button>
                <div
                  className={`panel ${
                    activeIndex === index ? "show" : "hidden"
                  } text-gray-700 2xl:text-[18px] 2xl:leading-8 my-2 leading-7`}
                >
                  <p className="text-[12px] lg:text-[16px]  2xl:text-[18px]">{faq.answer}</p>
                </div>
              </div>
            ))}
          </div>
        </div>
      </div>
    </>
  );
};

export default Page;
